Revert "Harshar"
